<?php

if(isset($_GET["cat"])){

}

echo "[{
  \"title\": \"مشخصات کلی\",
  \"value\": \"\"
},
{
  \"title\": \"ابعاد\",
  \"value\": \"7.7 × 74.7 × 158.5\",
  \"second\": \"\"
},{
  \"title\": \"توضیحات سیم کارت\",
  \"value\": \"سایز نانو\",
  \"second\": \"\"
},{
  \"title\": \"وزن\",
  \"value\": \"قاب جلو شیشه\",
  \"second\": \"\"
},{
  \"title\": \"ویژگی های خاص\",
  \"value\": \"مناسب عکاسی , فبلت , مجهز به حسگر اثرانگشت , مناسب عکاسی سلفی\",
  \"second\": \"\"
},{
  \"title\": \"حافظه\",
  \"value\": \"\"
},{
  \"title\": \"حافظه داخلی\",
  \"value\": \"128 گیگابایت\",
  \"second\": \"\"
},{
  \"title\": \"مقدار RAM\",
  \"value\": \"4 گیگابایت\",
  \"second\": \"\"
},{
  \"title\": \"پشتیبانی از کارت حافظه جانبی\",
  \"value\": \"دارد\",
  \"second\": \"\"
},{
  \"title\": \"صفحه نمایش\",
  \"value\": \"\"
},{
  \"title\": \"صفحه نمایش رنگی\",
  \"value\": \"دارد\",
  \"second\": \"\"
},{
  \"title\": \"صفحه نمایش لمسی\",
  \"value\": \"دارد\",
  \"second\": \"\"
},
{
  \"title\": \"فناوری\",
  \"value\": \"Super AMOLED\",
  \"second\": \"\"
},{
  \"title\": \"اندازه\",
  \"value\": \"6.4 اینچ\",
  \"second\": \"\"
},{
  \"title\": \"تعداد رنگ\",
  \"value\": \"16 میلیون رنگ\",
  \"second\": \"\" 
},{
  \"title\": \"ارتباطات\",
  \"value\": \"\"
},{
  \"title\": \"شبکه های ارتباطی\",
  \"value\": \"2G , 3G , 4G\",
  \"second\":\"\"
},{
  \"title\": \"شبکه 4G\",
  \"value\": \"LTE band 1|2100, 3|1800, 5|850, 7|2600, 8|900, 20|800, 38|2600, 40|2300, 41|2500\",
  \"second\": \"\"
},{
  \"title\": \"فناوری مکان یابی\",
  \"value\": \"\"
},{
  \"title\": \"دوربین\",
  \"value\": \"25.0 مگاپیکسل\",
  \"second\": \"\"
},{
  \"title\": \"رزولوشن عکس\",
  \"value\": \"25.0 مگاپیکسل\",
  \"second\": \"\"
},{
  \"title\": \"فلش\",
  \"value\": \"LED\",
  \"second\": \"\"
},{
  \"title\": \"قابلیت های دوربین\",
  \"value\": \"دارای سه حسگر دوربین\",
  \"second\": \"\"
},{
  \"title\": \"فیلمبرداری\",
  \"value\": \"رزولوشن 1080 × 1920 و سرعت 30 فریم بر ثانیه (1080p@30FPS)\",
  \"second\": \"\"
},{
  \"title\": \"دوربین سلفی\",
  \"value\": \"حسگری با رزولوشن 25 مگاپیکسل، دریچه ی دیافراگم f/2.0، فاصله کانونی لنز 25 میلی متر (Focal Length 25 mm)\",
  \"second\": \"\"
},{
  \"title\": \"صدا\",
  \"value\": \"\"
},{
  \"title\": \"بلندگو\",
  \"value\": \"ندارد\",
  \"second\": \"\"
},{
  \"title\": \"خروجی صدا\",
  \"value\": \"جک 3.5 میلی متری\",
  \"second\": \"\"
}]";