<?php
include "connect.php";
$search = trim($_GET["search"]);
$apps = array();
$query = " SELECT * FROM tbl_product WHERE title like '%" . $search . "%' ";
$res = $connect->prepare($query);
$res->bindParam(":search", $search);
$res->execute();

while ($row = $res->fetch(PDO::FETCH_ASSOC)) {
    $record = array();
    $record["id"] = $row["id"];
    $record["title"] = $row["title"];
    $record["introduction"] = $row["introduction"];
    $record["image"] = $row["image"];
    $record["properties"] = "[{
  \"title\": \"مشخصات کلی\",
  \"value\": \"\",
  \"second\": \"\"
},
{
  \"title\": \"ابعاد\",
  \"value\": \"7.7 × 74.7 × 158.5\",
  \"second\": \"8.7 × 77.7 × 163.5\"
},{
  \"title\": \"توضیحات سیم کارت\",
  \"value\": \"سایز نانو\",
  \"second\": \"سایز نانو\"
},{
  \"title\": \"وزن\",
  \"value\": \"قاب جلو شیشه\",
  \"second\": \"قاب جلو شیشه\"
},{
  \"title\": \"ویژگی های خاص\",
  \"value\": \"مناسب عکاسی , فبلت , مجهز به حسگر اثرانگشت , مناسب عکاسی سلفی\",
  \"second\": \" مجهز به حسگر اثرانگشت , مناسب عکاسی سلفی\"
},{
  \"title\": \"حافظه\",
  \"value\": \"\",
  \"second\": \"\"
},{
  \"title\": \"حافظه داخلی\",
  \"value\": \"128 گیگابایت\",
  \"second\": \"256 گیگابایت\"
},{
  \"title\": \"مقدار RAM\",
  \"value\": \"4 گیگابایت\",
  \"second\": \"3 گیگابایت\"
},{
  \"title\": \"پشتیبانی از کارت حافظه جانبی\",
  \"value\": \"دارد\",
  \"second\": \"دارد\"
},{
  \"title\": \"صفحه نمایش\",
  \"value\": \"\",
  \"second\": \"\"
},{
  \"title\": \"صفحه نمایش رنگی\",
  \"value\": \"دارد\",
  \"second\": \"دارد\"
},{
  \"title\": \"صفحه نمایش لمسی\",
  \"value\": \"دارد\",
  \"second\": \"دارد\"
},
{
  \"title\": \"فناوری\",
  \"value\": \"Super AMOLED\",
  \"second\": \"AMOLED\"
},{
  \"title\": \"اندازه\",
  \"value\": \"6.4 اینچ\",
  \"second\": \"6.7 اینچ\"
},{
  \"title\": \"تعداد رنگ\",
  \"value\": \"16 میلیون رنگ\",
  \"second\": \"16 میلیون رنگ\"
},{
  \"title\": \"ارتباطات\",
  \"value\": \"\",
  \"second\": \"\"
},{
  \"title\": \"شبکه های ارتباطی\",
  \"value\": \"2G , 3G , 4G\",
  \"second\": \"2G , 3G , 4G\"
},{
  \"title\": \"شبکه 4G\",
  \"value\": \"LTE band 1|2100, 3|1800, 5|850, 7|2600, 8|900, 20|800, 38|2600, 40|2300, 41|2500\",
  \"second\": \"LTE band 1|2100, 3|1800, 5|850, 7|2600, 8|900, 20|800, 38|2600, 40|2300, 41|2500\"
},{
  \"title\": \"فناوری مکان یابی\",
  \"value\": \"\",
  \"second\": \"\"
},{
  \"title\": \"دوربین\",
  \"value\": \"25.0 مگاپیکسل\",
  \"second\": \"20.0 مگاپیکسل\"
},{
  \"title\": \"رزولوشن عکس\",
  \"value\": \"25.0 مگاپیکسل\",
  \"second\": \"20.0 مگاپیکسل\"
},{
  \"title\": \"فلش\",
  \"value\": \"LED\",
  \"second\": \"LED\"
},{
  \"title\": \"قابلیت های دوربین\",
  \"value\": \"دارای سه حسگر دوربین\",
  \"second\": \"دارای سه حسگر دوربین\"
},{
  \"title\": \"فیلمبرداری\",
  \"value\": \"رزولوشن 1080 × 1920 و سرعت 30 فریم بر ثانیه (1080p@30FPS)\",
  \"second\": \"رزولوشن 1080 × 1920 و سرعت 30 فریم بر ثانیه (1080p@30FPS)\"
},{
  \"title\": \"دوربین سلفی\",
  \"value\": \"حسگری با رزولوشن 25 مگاپیکسل، دریچه ی دیافراگم f/2.0، فاصله کانونی لنز 25 میلی متر (Focal Length 25 mm)\",
  \"second\": \"حسگری با رزولوشن 25 مگاپیکسل، دریچه ی دیافراگم f/2.0، فاصله کانونی لنز 25 میلی متر (Focal Length 25 mm)\"
},{
  \"title\": \"صدا\",
  \"value\": \"\",
  \"second\": \"\"
},{
  \"title\": \"بلندگو\",
  \"value\": \"ندارد\",
  \"second\": \"ندارد\"
},{
  \"title\": \"خروجی صدا\",
  \"value\": \"جک 3.5 میلی متری\",
  \"second\": \"جک 3.5 میلی متری\"
}]";
    $apps[] = $record;
}

echo JSON_encode($apps);